ABA_League_app_api/app/controllers/leagues_controller.rb

  def index
    @leagues = League.all
---
SELECT "leagues".* FROM "leagues"

    def set_league
      @league = League.find(params[:id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]